# Thes all bot MEssages 
HOME_MESSAGE = {
    'HOME_MESSAGE':
                u'↫︙اهلاُ بك في بوت التحكم في الحساب .\n'
                u"↫︙يمكنك التحكم في حساباتك و تخزينها و التحكم بها من خلال البوت \n\n"
                u"↫︙Dev : @R_AFX ↫︙CH @radfx2 "
                u"",

    'SERVICE_MENU_MESSAGE':
                u"↫⚡️︙اهلان بك في قسم الخدمات يمكنك التحكم في حسابك من هاذا القسم "
                u""
                u"",

    "GET_CHAT_USERNAME":
                u"↫⚡️︙قم بي ارسال معرف القناة او المجموعة 💬\n\n"
                u"↫︙Ex : @username"
                u"",
    'GET_CHAT_USERNAME_ERR':
                u"↫⚠️︙عذرن المعرف غير صالح او الدردشا غير موجودة "
                u""
                u"",

    "ORDER_MESSAGE":
                U"↫⚡️︙جاري تنفيذ الطلب \n\n"
                U"↫💠︙معلومات الطلب :\n"
                U"↫︙العدد : ❲ {} ❳\n"
                U"↫︙النوع : ❲ {} ❳\n"
                U"↫︙تم الوصول : ❲ {} ❳\n"
                U"↫︙لم يتم الوصول : ❲ {} ❳\n\n"
                U"↫︙حالة الطلب : ❲ {} ❳\n"
                U"",


    # ADD ACCOUNTS MESSAGE 
    "WITH_LODING":
                u"↫⚙️︙انتضر قليلاً جاري المعالجة "
                u""
                u"",

    "GET_PHONE":
                u"↫⚡️︙قم بي ارسال رقم الهاتف متبوع بي رمز الدولة .\n\n"
                u"↫💠︙Ex: +963998746223"
                u"", 
    "GET_CODE":
                u"↫💬︙قم بي اراسل كود التحقق .\n\n"
                u"↫💠︙Ex: 23345", 
    "GET_PASSWORD":
                u"↫🔗︙قم بي ارسال  كلمت سر التحق بي خطوتين ."
                u"", 
    # Errors 
    "GET_PHONE_ERROR":
                u"↫⚠️︙عذرن رقم الهاتف غير صالح .", 
    "GET_CODE_ERROR_1":
                u"↫⚠️︙عذرن كود التحقق غير صالح ."
                u"",
    "GET_CODE_ERROR_2":
                u"↫⚠️︙عذرن كود التحقق غير صحيح"
                u"",
    "GET_PASSWORD_ERROR":
                u"↫⚠️︙عذرن كلمت الرس غير صحيحة"
                u"",
    
    'DONE_ADD_SESSION':
                u"↫✅︙تمت اضافة الحساب بي نجاح عدد حساباتك الاًن ↫︙ ❲ {} ❳."
                u""
                u"",  

    'ACCOUNT_CHECKING':
                u"↫⚙️︙جاري فحص الحسابات . \n\n"
                u"↫🔗︙عدد الحسابات : ❲ {} ❳\n"
                u"↫⚡️︙تم الوصول : ❲ {} ❳\n"
                u"↫♻️︙تعمل      : ❲ {} ❳\n"
                u"↫⚠️︙لا تعمل    : ❲ {} ❳\n"
                u"↫💠︙حالة الفحص   : ❲ {} ❳\n"
                u"", 
    'DONE_CHECK':
                u"↫✅︙تمت عملية الفحص بي نجاح \n\n"
                u"↫︙"
                u"↫♻️︙سجل الفحص : \n"
                u"↫⚡️︙الحسابت التي تعمل : ❲ {} ❳\n"
                u"↫⚠️︙الحسابت التي لا تعمل : ❲ {} ❳\n\n"
                u"↫💠︙لي حذف الحسابت المعطلة اضغط على تنضيف"
                u"", 
    'WITH_CLEAR':
                u"↫⚡️︙جاري تنضيف الحسابات "
                u""
                u"", 
    'DONE_CLEAR_ACCOUNT':
                u"↫✅︙تم تنضيف الحسابات وحذف ❲ {} ❳ حساب"
}